Revit 2025 API
Document.NewAreaBoundaryConditions(Element, TranslationRotationValue, Double, TranslationRotationValue, Double, TranslationRotationValue, Double) Method
 Creates a new Area BoundaryConditions element on a host element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public BoundaryConditions NewAreaBoundaryConditions(
	Element hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
Public Function NewAreaBoundaryConditions (
	hostElement As Element,
	X_Translation As TranslationRotationValue,
	X_TranslationSpringModulus As Double,
	Y_Translation As TranslationRotationValue,
	Y_TranslationSpringModulus As Double,
	Z_Translation As TranslationRotationValue,
	Z_TranslationSpringModulus As Double
) As BoundaryConditions
public:
BoundaryConditions^ NewAreaBoundaryConditions(
	Element^ hostElement,
	TranslationRotationValue X_Translation,
	double X_TranslationSpringModulus,
	TranslationRotationValue Y_Translation,
	double Y_TranslationSpringModulus,
	TranslationRotationValue Z_Translation,
	double Z_TranslationSpringModulus
)
member NewAreaBoundaryConditions :
        hostElement : Element *
        X_Translation : TranslationRotationValue *
        X_TranslationSpringModulus : float *
        Y_Translation : TranslationRotationValue *
        Y_TranslationSpringModulus : float *
        Z_Translation : TranslationRotationValue *
        Z_TranslationSpringModulus : float -> BoundaryConditions
Parameters
hostElement Element
 A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation TranslationRotationValue
 A value indicating the X axis translation option.
X_TranslationSpringModulus Double
 Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation TranslationRotationValue
 A value indicating the Y axis translation option.
Y_TranslationSpringModulus Double
 Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation TranslationRotationValue
 A value indicating the Z axis translation option.
Z_TranslationSpringModulus Double
 Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Return Value
BoundaryConditions
If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Exceptions
Exception | Condition
ArgumentException | Thrown if the host element does not exist in the given document.
Remarks
This method will only function with the Autodesk Revit Structure application.
Example
bool CreateAreaConditionWithElement(AnalyticalPanel wall, Autodesk.Revit.Creation.Document docCreation)
{
   // Create Area Boundary Conditions using a given Wall and defaulting to fixed in all directions
   BoundaryConditions condition = docCreation.NewAreaBoundaryConditions(wall, TranslationRotationValue.Fixed, 0,
                                                                              TranslationRotationValue.Fixed, 0,
                                                                              TranslationRotationValue.Fixed, 0);
   return (null != condition);
}
Private Function CreateAreaConditionWithElement(wall As Wall, docCreation As Autodesk.Revit.Creation.Document) As Boolean
    ' Create Area Boundary Conditions using a given Wall and defaulting to fixed in all directions
    Dim condition As BoundaryConditions = docCreation.NewAreaBoundaryConditions(wall, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, 0, TranslationRotationValue.Fixed, _
        0)
    Return (condition IsNot Nothing)
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Document Class
NewAreaBoundaryConditions Overload
Autodesk.Revit.Creation Namespace